{
/* Passphrase panel titles */
"MESSAGE_AUTHENTICATION_TITLE" = "Autentisering av meddelande";
"MESSAGE_DECRYPTION_PASSPHRASE_TITLE" = "Dekryptering av meddelande";

/**/
"DECRYPTING" = "Dekrypterar...";
"ENCRYPTING" = "Krypterar...";

/* <PGP> submenu title */
"PGP_MENU" = "PGP";
/* <PGP Keys> submenu title */
"PGP_KEYS_MENU" = "PGP-Nycklar";

/* <PGP> submenu items */
"DECRYPT_MENU" = "Dekryptera";
"AUTHENTICATE_MENU" = "Autentisera";
"ENCRYPT_MENU" = "Kryptera nytt meddelande";
"SIGN_MENU" = "Signera nytt meddelande";

/* Description of version prefixed with <Version:> */
"VERSION: %@" = "Version: %@";

/* PGP preferences panel name */
"PGP_PREFERENCES" = "PGP";

/* Alert title and message */
"MSG_DECRYPTION_ALERT_TITLE_NOT_SIGNED" = "Dekryptering av meddelande";
"DECRYPTED_MSG_NOT_SIGNED" = "Meddelandet har krypterats men har inte signerats. Dess autenticitet kan inte bevisas.";
"MSG_ENCRYPTION_ALERT_TITLE" = "PGP-kryptering misslyckades";
"MSG_DECRYPTION_ALERT_TITLE" = "PGP-dekryptering misslyckades";
"MSG_SIGNING_ALERT_TITLE" = "PGP-signering misslyckades";
"UNSUPPORTED_ENCRYPTION_FORMAT" = "GPGMail kan inte dekryptera denna typ av krypterade meddelanden.";
"DATA_NOT_AVAILABLE" = "Innehållet i meddelandet är ej tillgängligt för tillfället.";

/* Informational alert title and message */
"AUTHENTICATION_TITLE_OK" = "PGP-autentisering";

/**/
"AUTHENTICATION_TITLE_FAILED" = "PGP-autentisering misslyckades";
"TRY_AGAIN" = "Försök igen";
"CANCEL_DELIVERY" = "Avbryt";
"CANCEL_DECRYPTION" = "Avbryt";

/**/
"AUTHENTICATION_TITLE_UNSIGNED" = "PGP-autentisering";
"UNSIGNED_PGP_MESSAGE" = "Detta meddelande är inte signerat med PGP.";

/* Toolbar item titles */
"DECRYPT_ITEM" = "Dekryptera";
"AUTHENTICATE_ITEM" = "Autentisera";
"MAKE_ENCRYPTED_ITEM" = "Gör krypterat";
"MAKE_CLEAR_ITEM" = "Gör i klartext";
"MAKE_UNSIGNED_ITEM" = "Gör osignerat";
"MAKE_SIGNED_ITEM" = "Gör signerat";
"ENCRYPTED_ITEM" = "Krypterat";
"CLEAR_ITEM" = "I klartext";
"SIGNED_ITEM" = "Signerat";
"UNSIGNED_ITEM" = "Osignerat";

/* Toolbar item tooltips  */
"DECRYPT_ITEM_TOOLTIP" = "Dekryptera PGP-krypterat meddelande";
"AUTHENTICATE_ITEM_TOOLTIP" = "Autentisera PGP-signerat meddelande";
"MAKE_CLEAR_ITEM_TOOLTIP" = "Klicka för att skicka ett meddelande i klartext";
"MAKE_ENCRYPTED_ITEM_TOOLTIP" = "Klicka för att använda PGP-kryptering";
"MAKE_UNSIGNED_ITEM_TOOLTIP" = "Klicka för att skicka ett meddelande utan PGP-autentisering";
"MAKE_SIGNED_ITEM_TOOLTIP" = "Klicka för att använda PGP-autentisering";
"ENCRYPTED_ITEM_TOOLTIP" = "Meddelandet kommer att krypteras; klicka för att skicka meddelandet i klartext";
"CLEAR_ITEM_TOOLTIP" = "Meddelande kommer att skickas i klartext; klicka för att använda PGP-kryptering";
"SIGNED_ITEM_TOOLTIP" = "Meddelandet kommer att signeras med PGP; klicka för att skicka meddelandet utan PGP-autentisering";
"UNSIGNED_ITEM_TOOLTIP" = "Meddelandet kommer inte att signeras med PGP; klicka för att använda PGP-autentisering";

/* Signature information */
"Bad policy!"  = "Dålig policy! "; // Followed by a list of policy URLs
"Policy: " = "Policy: "; // Followed by a list of policy URLs
"Signed on %@" = "Signerat den %@"; // Param is a date, whose format is set by SIGNATURE_CREATION_DATE_FORMAT
"SIGNATURE_CREATION_DATE_FORMAT" = "%c"; // See NSCalendarDate documentation for format
"No signature creation date available" = "Det finns inget datum för signaturens skapande";
"Key fingerprint: %@" = "Nyckelns fingeravtryck: %@";
"Key ID: 0x%@" = "Nyckel-ID: 0x%@";
"No key fingerprint/ID available" = "Inget fingeravtryck/ID finns att tillgå för nyckeln";
"Validity: %@" = "Validitet: %@"; // Param is the validity status string
"Signature expires on %@" = "Signatur går ut den %@"; // Param is a date, whose format is set by SIGNATURE_EXPIRATION_DATE_FORMAT
"SIGNATURE_EXPIRATION_DATE_FORMAT" = "%x"; // See NSCalendarDate documentation for format
"Key expired on %@" = "Nyckel gick ut den %@"; // Param is a date, whose format is set by KEY_EXPIRATION_DATE_FORMAT
"KEY_EXPIRATION_DATE_FORMAT" = "%x"; // See NSCalendarDate documentation for format
"Signed by %@." = "Signerat av %@."; // Param is a userID
"Signature from %@ is bad!" = "Dålig signatur från %@!"; // Param is a userID
"Signature is bad!" = "Dålig signatur!";
"Signature status error." = "Signaturstatus-fel.";
"MISSING KEY %@." = "Saknad nyckel %@."; // Param is a key ID in hexadecimal
"Signature summary 0x%04x - Signature status %u." = "Okänt fel: signatursammanfattning 0x%04x - signaturstatus %u."; // Generic error message; first param is a hex status flag value, second is a decimal status value
"EXCEPTION: %@" = "Internt fel: %@"; // Generic error message; param is a string (exception reason, maybe not localized)
"AUTHENTICATING" = "Verifierar PGP-signatur...";
"UNTRUSTED RECIPIENTS" = "Åtminstone en av nycklarna är inte betrodd";

/* Title */
/* Error messages */
"GPGMAIL_CANNOT_WORK" = "GPGMail kan inte fungera eftersom en hjälpapplikation inte kunde startas. Försök starta om Mail. Kvarstår felet, skicka ett meddelande till gpgmail-devel@lists.gpgmail.org";
"GPGMAIL_CANNOT_WORK_HAS_GPG_%@_VERSION_%@_NEEDS_%@" = "GPGMail kan inte fungera. GnuPG (%@) version %@ hittades, men GPGMail kräver åtminstone version %@. Avsluta Mail, installera en matchande GnuPG-version (till exempel från MacGPG Project, http://macgpg.sourceforge.net/), återstarta därefter Mail."; // First arg is path to gpg, second and third are version strings
"GPGMAIL_CANNOT_WORK_MISSING_GPG_%@_VERSION_%@" = "GPGMail kan inte fungera. GnuPG (%@) med åtminstone version %@ kunde inte hittas. Avsluta Mail, installera en matchande GnuPG-version (till exempel från MacGPG Project, http://macgpg.sourceforge.net/), återstarta därefter Mail."; // First arg is path to gpg, second is version string
"INVALID_GPGMAIL_VERSION" = "Din version av GPGMail är inte kompatibel med din version av Mail."; /* Title of alert sheet */
"NEEDS_COMPATIBLE_BUNDLE_VERSION" = "Du måste ladda ned och installera en GPGMail-version som motsvarar din version av Mac OS. Gå till http://www.gpgmail.org/ för att hämta den.";

/* Validity */
"VALIDITY: " = "validitet: ";
"Validity=0" = "okänd";
"Validity=1" = "odefinierad";
"Validity=2" = "aldrig";
"Validity=3" = "marginell";
"Validity=4" = "full";
"Validity=5" = "ultimat";

/* Generic MacGPGME error messages */
"GPGErrorCode=1" = "Generellt fel";
"GPGErrorCode=8" = "Dålig signatur";
"GPGErrorCode=9" = "Ingen publik nyckel";
"GPGErrorCode=10" = "Fel checksumma";
"GPGErrorCode=11" = "Fel på lösenord";
"GPGErrorCode=15" = "Ogiltigt skydd";
"GPGErrorCode=17" = "Ingen hemlig nyckel";
"GPGErrorCode=31" = "Ogiltigt lösenord";
"GPGErrorCode=40" = "Fel vid anslutning till nyckelserver";
"GPGErrorCode=53" = "Oanvändbar publik nyckel";
"GPGErrorCode=54" = "Oanvändbar hemlig nyckel";
"GPGErrorCode=55" = "Ogiltigt värde";
"GPGErrorCode=58" = "Ingen data";
"GPGErrorCode=69" = "Ej implementerat";
"GPGErrorCode=84" = "Algoritm stöds inte";
"GPGErrorCode=94" = "Nyckel återkallad";
"GPGErrorCode=99" = "Avbruten";
"GPGErrorCode=107" = "Tvetydigt namn";
"GPGErrorCode=116" = "Ingen matchande policy";
"GPGErrorCode=125" = "Felaktigt nyckelanvändande";
"GPGErrorCode=150" = "Ogiltig motor";
"GPGErrorCode=151" = "Publik nyckel är inte betrodd";
"GPGErrorCode=152" = "Dekryptering misslyckades";
"GPGErrorCode=153" = "Nyckeln är utgången";
"GPGErrorCode=154" = "Signaturen är utgången";
"GPGErrorCode=16383" = "EOF";

/* Signature attachment filename (suffixed automatically by .sig) */
"PGP_SIGNATURE_FILENAME" = "PGP";

/* Signature attachment content-description */
"This is a digitally signed message part" = "Detta är en digitalt signerad del av meddelandet";

/* Version MIME part content description header */
"CONTENT_DESCRIPTION_HEADER" = "PGP/MIME version identification";

/* Encrypted attachment filename (suffixed automatically by .asc) */
"PGP_ENCRYPTED_FILENAME" = "PGP";

/* Encrypted attachment content-description */
"This is an encrypted message part" = "OpenPGP-krypterat meddelande";

/* Multiple-part description */
"MULTIPART_ENCRYPTED_DESCRIPTION" = "Detta är ett OpenPGP/MIME-krypterat meddelande (RFC 2440 och 3156)";
"MULTIPART_SIGNED_DESCRIPTION" = "Detta är ett OpenPGP/MIME-signerat meddelande (RFC 2440 och 3156)";

/* Tooltip for banner icons */
"SIGNATURE_IS_GOOD" = "Signaturen är OK; meddelandet har inte förändrats";
"SIGNATURE_IS_NOT_GOOD" = "Signaturen är dålig; meddelandet har förändrats";

/* PGP Key Download panel */
"PGP_SEARCH_KEYS_MENUITEM" = "PGP-Nyckelsökning";
"SEARCH" = "Sök";
"CANCEL_SEARCH" = "Avbryt";
"SEARCHING" = "Söker...";
"NO_MATCHING_KEYS" = "Ingen matchande nyckel";
"FOUND_%d_KEYS" = "Fann %d matchande nyckel/nycklar";
"DOWNLOAD" = "Ladda ner";
"DOWNLOADING" = "Laddar ner...";
"DOWNLOADED" = "Laddade ner och importerade nyckel/nycklar";
"SEARCH_KEYS_ON_SERVER" = "Sök PGP-nycklar på nyckelserver";
"DOWNLOAD_KEYS_FROM_SERVER" = "Ladda ner PGP-nycklar från nyckelserver";
"SEARCH_ERROR" = "Ett fel inträffade under sökningen";
"DOWNLOAD_ERROR" = "Ett fel inträffade under nedladdningen";
" (%u bits)" = " (%u bitar)";
", created on %@" = ", skapad den %@";
", expires on %@" = ", går ut den %@";
", expired on %@" = ", gick ut den %@";
"REVOKED_KEY - " = "Återkallad - "; // Prefixes found key description, when necessary; followed by keyID, userID, etc.

/* Unmatched PGP keys for receipts - sheet */
"MISSING_KEYS: DOWNLOAD" = "Somliga adresser matchar ingen PGP-nyckel. Sök efter nycklar?"; // Title
"UNMATCHED_ADDRESSES: %@" = "Följande adresser har ingen matchande PGP-nyckel:\n%@"; // Message
"SEARCH_MATCHING_KEYS" = "Sök"; // Default button
"SEND_IN_CLEAR" = "Skicka i klartext"; // Other button

"INVALID_HASH_%@" = "Hash-algoritmen '%@' tillåts inte av RFC3156.";
"GPGMAIL_VS_PGPMAIL" = "GPGMail kan inte fungera med PGPmail installerat";
"GPGMAIL_%@_VS_PGPMAIL_%@" = "Båda paketen ger samma funktionalitet men använder olika motorer, och endast en av dem kan vara installerad. Du måste antingen ta bort '%@', eller '%@'.";
"QUIT" = "Avsluta";
"CONTINUE_ANYWAY" = "Försök fortsätta";

/* Composer accessory view header, under To:, CC:, Subject: */
"PGP:" = "PGP:";

/* Key description in popups; prefixes key (actually, primary userID), when necessary; followed by keyID, userID, etc.*/
"REVOKED_KEY:" = "Återkallad:";
"EXPIRED_KEY:" = "Utgången:";
"DISABLED_KEY:" = "Avstängd:";
"INVALID_KEY:" = "Ogiltig:";

/* UserID description in popups; prefixes userID, when necessary; followed by name, email, etc.*/
"REVOKED_USER_ID:" = "Återkallad:";
"INVALID_USER_ID:" = "Ogiltig:";

/* GPGMail exception reasons */
"NO_VALID_PUBLIC_KEY" = "Ingen giltig publik nyckel kan hittas. De har alla antingen gått ut, stängts av eller återkallats."; // Could be displayed after encryption
"NO_VALID_PRIVATE_KEY" = "Ingen giltig privat nyckel kan hittas. Antingen har ingen nyckel valts eller också har vald nyckel gått ut, stängts av eller återkallats."; // Could be displayed after encryption

/* Alert when user has no PGP key */
"NO PGP PRIVATE KEY - TITLE" = "Du har ingen PGP-nyckel. Du kan inte använda GPGMail för att kryptera eller signera meddelanden.";
"NO PGP PRIVATE KEY - MESSAGE" = "Om du vill kunna kryptera eller signera meddelanden med PGP, behöver du en personlig PGP-nyckel. För att skapa en PGP-nyckel, ladda ner och installera MacGPGs GPG Keychain Access (GPG Nyckelhanterare) från http://macgpg.sourceforge.net/";

/* Conflict resolution panel*/
"<ME>" = "Jag";
"<YES>" = "Ja";
"<NO>" = "Nej";
"<ALWAYS>" = "Alltid";
"<NEVER>" = "Aldrig";
"<ACCEPTS>" = "Accepterar";

/* Additional info describing key */
"DISABLED_KEY_QUALIFIER" = "avstängd";
"INVALID_KEY_QUALIFIER" = "ogiltig";
"REVOKED_KEY_QUALIFIER" = "återkallad";
"EXPIRED_KEY_QUALIFIER" = "utgången";
"CANNOT_ENCRYPT_KEY_QUALIFIER" = "kan inte kryptera";
"CANNOT_SIGN_KEY_QUALIFIER" = "kan inte signera";

/* Additional info describing userID */
"INVALID_USER_ID_QUALIFIER" = "ogiltig";
"REVOKED_USER_ID_QUALIFIER" = "återkallad";

"COPY_MSG_URL_MENUITEM" = "Copy Message URL";
}
